[
  {
    "policyId":"441273e0-1bfe-4508-87d5-d26bdfb156d8",
    "policyName":"MS Teams - External Guest Users download block",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"browser\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"cc15fd57-2c6c-4117-a88c-83b1d56b4bbe\", \"00000003-0000-0ff1-ce00-000000000000\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"GuestsOrExternalUsers\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": []}}",
    "grantControls":null,
    "includedApplications":"[\"cc15fd57-2c6c-4117-a88c-83b1d56b4bbe\", \"00000003-0000-0ff1-ce00-000000000000\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"aee25a57-cda0-4d92-9523-61cb6b3368ec",
    "policyName":"CA002 - Block_Legacy_Authentication",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"612f7a3c-e1eb-432a-aad0-42019d2ddc97\", \"33c7877a-db7e-4c18-adaf-89906e2f3afd\", \"f2bc9f7e-0e8a-40ef-87d7-cc18ebbcb9d9\", \"f930eecf-94a2-492d-a317-ab8c86b0e56c\", \"0418de2e-abb3-4804-9594-970b3da85fff\", \"a7387f54-4dc8-416f-b2be-6cb77c249931\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('aee25a57-cda0-4d92-9523-61cb6b3368ec')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"620e194a-ff5a-4f0a-94df-1792ad1aaf41",
    "policyName":"Finance Team- Require Compliant Device to Access Exchange Online",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"browser\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"Office365\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"734e3483-dff7-4b30-9a39-afe0c0508894\", \"0dfab503-8537-4858-ab46-27de3ee194db\", \"04e8b85d-445d-4184-9829-2a33b5a5dec5\", \"57c3fb5c-b597-44f9-8aff-fa903bd8edd4\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"windows\", \"macOS\", \"linux\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"compliantDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('620e194a-ff5a-4f0a-94df-1792ad1aaf41')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"Office365\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"2f1e1bdd-ad17-4e30-afaa-009ed076d1ea",
    "policyName":"[SharePoint admin center]Block access from apps on unmanaged devices - 2025\/05\/20",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"mobileAppsAndDesktopClients\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"00000003-0000-0ff1-ce00-000000000000\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"compliantDevice\", \"domainJoinedDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('2f1e1bdd-ad17-4e30-afaa-009ed076d1ea')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"00000003-0000-0ff1-ce00-000000000000\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"3cec569f-3f8d-4149-ae1b-8d112ccbf773",
    "policyName":"[SharePoint admin center]Use app-enforced Restrictions for browser access - 2025\/05\/20",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"browser\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"00000003-0000-0ff1-ce00-000000000000\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":null,
    "includedApplications":"[\"00000003-0000-0ff1-ce00-000000000000\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"0d945e0f-2a9e-438c-8e7e-a411a5204567",
    "policyName":"[SharePoint admin center]Block access from apps on unmanaged devices - 2025\/05\/20",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"mobileAppsAndDesktopClients\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"00000003-0000-0ff1-ce00-000000000000\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"compliantDevice\", \"domainJoinedDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('0d945e0f-2a9e-438c-8e7e-a411a5204567')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"00000003-0000-0ff1-ce00-000000000000\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"89b34da8-5ab4-47e6-bef9-38f62c800a4b",
    "policyName":"[SharePoint admin center]Use app-enforced Restrictions for browser access - 2025\/05\/20",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"browser\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"00000003-0000-0ff1-ce00-000000000000\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":null,
    "includedApplications":"[\"00000003-0000-0ff1-ce00-000000000000\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"6d3d8328-316a-4f66-b7c4-993b484597ec",
    "policyName":"MFA for app gate",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"95d96562-d5ca-4a4f-ae03-37460e4bfc14\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('6d3d8328-316a-4f66-b7c4-993b484597ec')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"95d96562-d5ca-4a4f-ae03-37460e4bfc14\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"5149990b-f345-4b69-805a-a6a4a5f59494",
    "policyName":"Windows & macOS Mandatory Enrollment Policy",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"mobileAppsAndDesktopClients\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"fc780465-2017-40d4-a0c5-307022471b92\", \"Office365\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"972af6ae-90d2-441e-8436-2860f812896f\", \"8c012a26-eca0-4760-89ac-51be633029ec\", \"36860932-dfe6-4bef-ad58-3b2e3a146329\"], \"includeGroups\": [], \"excludeGroups\": [\"94019ce5-f1c3-43ce-8ee1-1a555a72f4c1\"], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"windows\", \"macOS\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\", \"compliantDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('5149990b-f345-4b69-805a-a6a4a5f59494')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"fc780465-2017-40d4-a0c5-307022471b92\", \"Office365\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"2698459a-29b2-407e-a157-68f6bbf22a5b",
    "policyName":"Paramount Cloud App Security Session Policy",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"MicrosoftAdminPortals\", \"Office365\"], \"excludeApplications\": [\"00000005-0000-0ff1-ce00-000000000000\"], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":null,
    "includedApplications":"[\"MicrosoftAdminPortals\", \"Office365\"]",
    "excludedApplications":"[\"00000005-0000-0ff1-ce00-000000000000\"]"
  },
  {
    "policyId":"f2a9fcfe-16c0-4c8d-b579-3e71fb5a362a",
    "policyName":"CA004 - Require MFA for All Users\/Cloud apps",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"browser\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"6499c40e-5ca5-4512-92cb-c203bbc90e0d\", \"679f7962-bdae-46e7-9b8b-fcd1bb3b4663\", \"33c7877a-db7e-4c18-adaf-89906e2f3afd\", \"f2bc9f7e-0e8a-40ef-87d7-cc18ebbcb9d9\", \"822c2691-bc4e-46b0-a0d1-234e1b056978\", \"574ed3a4-29f7-4cf8-a3e9-d4b3fc32b064\", \"42fdbba6-62ff-49c1-a28c-94161f898f74\", \"6b7657e9-4023-4e52-aa16-559450b317be\", \"4fa1a3f9-ab6f-4dc8-bc1a-645d8cd9f4f4\", \"c118f0ca-b97c-4d2c-a4f8-a24ad21bf367\", \"63c81bce-6d95-449f-b366-f4c36cba8712\", \"a665ff1c-349b-48b7-a583-192304a7682b\", \"36860932-dfe6-4bef-ad58-3b2e3a146329\", \"d531d1b3-b11c-4c45-8255-5748c0b15ad1\", \"df612b23-43f7-47ad-8214-615b17231b27\", \"1a9c8ad6-3841-4862-85a8-5e49cd1f351f\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('f2a9fcfe-16c0-4c8d-b579-3e71fb5a362a')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"15ec720a-dc7a-4463-aaec-488183cbec86",
    "policyName":"Enforce MDM-Prem",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"browser\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"00000002-0000-0ff1-ce00-000000000000\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"2c75fd67-a072-477d-83df-9d0841431d4b\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"windows\", \"windowsPhone\", \"macOS\", \"linux\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"compliantDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('15ec720a-dc7a-4463-aaec-488183cbec86')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"00000002-0000-0ff1-ce00-000000000000\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"f42d523a-6ddf-42f4-9295-cdb41719cbad",
    "policyName":"Location Based Access- Prem",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"browser\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"Office365\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"2c75fd67-a072-477d-83df-9d0841431d4b\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": [\"1ebb467e-53cf-445d-b5ba-aa901e967dcc\"]}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('f42d523a-6ddf-42f4-9295-cdb41719cbad')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"Office365\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"3e330fbc-7bbd-4dc7-a207-dfba5c3df873",
    "policyName":"Head Office",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"browser\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"36860932-dfe6-4bef-ad58-3b2e3a146329\", \"9b0b32a4-d4b3-40e0-b421-92a116ccd016\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": [\"17d25d09-87c6-4477-983c-fb43f6e6dc50\"]}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('3e330fbc-7bbd-4dc7-a207-dfba5c3df873')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"59e225cc-bff4-45c8-9e34-477f3c578caf",
    "policyName":"CA011 - HRMS-BLOCK",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"37ca789f-1ea4-4f51-b36b-148287bf2d6f\", \"a8d02a05-85ea-4874-b3be-b76992a65d01\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"57c3fb5c-b597-44f9-8aff-fa903bd8edd4\", \"8c012a26-eca0-4760-89ac-51be633029ec\", \"05c7e7f7-f7d4-43e5-ab0e-89d59b50bb72\", \"9169ee2f-56a9-48db-8cb7-77f197a51bf0\", \"bb59b008-4001-4788-967e-8f4c59d9e706\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('59e225cc-bff4-45c8-9e34-477f3c578caf')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"37ca789f-1ea4-4f51-b36b-148287bf2d6f\", \"a8d02a05-85ea-4874-b3be-b76992a65d01\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"6917318b-bdd6-4e40-b240-5dd3cfe467c4",
    "policyName":"PCS - Enforce MDM for windows & Mac",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"0418de2e-abb3-4804-9594-970b3da85fff\", \"b03e8130-a5ab-41f3-b530-df1629e5cb5e\", \"36860932-dfe6-4bef-ad58-3b2e3a146329\", \"131fd735-a66e-4ae7-a119-9cf2ba8d9879\", \"1ac12a42-5318-4c55-90c8-c34ea2855904\", \"7fa69847-c64d-4d10-8416-f92dd492993f\", \"dcacb04f-1360-4d83-8c55-2f1bdc3762cf\", \"2d2f7567-9445-4b9e-a9f8-a8cc04bf0829\", \"4fe4a56b-3623-455e-9b4d-7df121b36699\", \"a2c8c26d-9786-44b9-8ad8-1330c69b764c\", \"3c36d97e-3ab6-4843-906a-4046a5a6e056\", \"6a8f9c80-2ebf-40f5-9d26-9036db205a49\", \"e5f47082-e16b-4429-9d36-09d4b1354a24\", \"25dacb82-5251-4c72-b169-969637d4b37f\", \"98a08685-1887-4994-a536-7b72fe7efae4\", \"26c82188-c75a-4603-8f5f-c92069eaa698\", \"cac11189-5383-47b8-9685-c3de26c2349e\", \"ee7ab89d-7719-4787-bae3-623f27404cd8\", \"cb92afa6-893c-46ac-8e26-e88140f0c773\", \"831a62ad-3298-4938-b04a-b5b798b786d1\", \"2178a9b4-8307-4ab1-83b9-93310a4c9728\", \"c316f5bf-434d-48c0-9fef-ba026d1a9ef4\", \"a0f33ed2-c782-4f39-8648-6c05cca3798b\", \"183830e5-7716-4f65-820e-79f9be388c9f\", \"b1ce00f3-ac3e-46e6-814c-e0134f1f1d6d\", \"05c7e7f7-f7d4-43e5-ab0e-89d59b50bb72\"], \"excludeUsers\": [\"831a62ad-3298-4938-b04a-b5b798b786d1\"], \"includeGroups\": [\"a5b96dce-4341-46f0-a0c0-966242d9a183\"], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"windows\", \"macOS\", \"linux\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"compliantDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('6917318b-bdd6-4e40-b240-5dd3cfe467c4')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"46563dd0-5608-4618-8f74-bbfd475faaf2",
    "policyName":"Sign-in frequency and browser sessions are not persistent",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"browser\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [\"3c36d97e-3ab6-4843-906a-4046a5a6e056\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [\"9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3\", \"cf1c38e5-3621-4004-a7cb-879624dced7c\", \"9c6df0f2-1e7c-4dc3-b195-66dfbd24aa8f\", \"c430b396-e693-46cc-96f3-db01bf8bb62a\", \"58a13ea3-c632-46ae-9ee0-9c0d43cd7f3d\", \"ffd52fa5-98dc-465c-991d-fc073eb59f8f\", \"8424c6f0-a189-499e-bbd0-26c1753c96d4\", \"1d336d2c-4ae8-42ef-9711-b3604ce3fc2c\", \"c4e39bd9-1100-46d3-8c65-fb160da0071f\", \"25a516ed-2fa0-40ea-a2d0-12923a21473a\", \"0526716b-113d-4c15-b2c8-68e3c22b9f80\", \"9f06204d-73c1-4d4c-880a-6edb90606fd8\", \"e3973bdf-4987-49ae-837a-ba8e231c7286\", \"7495fdc4-34c4-4d15-a289-98788ce399fd\", \"aaf43236-0c0d-4d5f-883a-6955382ac081\", \"3edaf663-341e-4475-9f94-5c398ef6c070\", \"b0f54661-2d74-4c50-afa3-1ec803f12efe\", \"892c5842-a9a6-463a-8041-72aa08ca3cf6\", \"158c047a-c907-4556-b7ef-446551a6b5f7\", \"7698a772-787b-4ac8-901f-60d6b08affd2\", \"17315797-102d-40b4-93e0-432062caca18\", \"e6d1a23a-da11-4be4-9570-befc86d067a7\", \"b1be1c3e-b65d-4f19-8427-f6fa0d97feb9\", \"5c4f9dcd-47dc-4cf7-8c9a-9e4207cbfc91\", \"38a96431-2bdf-4b4c-8b6e-5d3d8abac1a4\", \"88d8e3e3-8f55-4a1e-953a-9b9898b8876b\", \"d29b2b05-8046-44ba-8758-1e26182fcf32\", \"9360feb5-f418-4baa-8175-e2a00bac4301\", \"8329153b-31d0-4727-b945-745eb3bc5f31\", \"44367163-eba1-44c3-98af-f5787879f96a\", \"3f1acade-1e04-4fbc-9b69-f0302cd84aef\", \"29232cdf-9323-42fd-ade2-1d097af3e4de\", \"31392ffb-586c-42d1-9346-e59415a2cc4e\", \"6e591065-9bad-43ed-90f3-e9424366d2f0\", \"0f971eea-41eb-4569-a71e-57bb8a3eff1e\", \"be2f45a1-457d-42af-a067-6ec1fa63bc45\", \"62e90394-69f5-4237-9190-012177145e10\", \"f2ef992c-3afb-46b9-b7cf-a126ee74c451\", \"fdd7a751-b60b-444a-984c-02652fe8fa1c\", \"95e79109-95c0-4d8e-aee3-d01accf2d47b\", \"729827e3-9c14-49f7-bb1b-9608f156bbb8\", \"8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2\", \"45d8d3c5-c802-45c6-b32a-1d70b5e1e86e\", \"eb1f4a8d-243a-41f0-9fbd-c7cdf6c5ef7c\", \"25df335f-86eb-4119-b717-0ff02de207e9\", \"31e939ad-9672-4796-9c2e-873181342d2d\", \"3a2c62db-5318-420d-8d74-23affee5d9d5\", \"74ef975b-6605-40af-a5d2-b9539d836353\", \"b5a8dcf3-09d5-43a9-a639-8e29ef291470\", \"744ec460-397e-42ad-a462-8b3f9747a02c\", \"4d6ac14f-3453-41d0-bef9-a3e0c569773a\", \"59d46f88-662b-457b-bceb-5c3809e5908f\", \"ac16e43d-7b2d-40e0-ac05-243ff356ab5b\", \"790c1fb9-7f7d-4f88-86a1-ef1f95c05c1b\", \"1501b917-7653-4ff9-a4b5-203eaf33784f\", \"281fe777-fb20-4fbb-b7a3-ccebce5b0d96\", \"d37c8bed-0711-4417-ba38-b4abe66ce4c2\", \"2b745bdf-0803-4d80-aa65-822c4493daac\", \"507f53e4-4e52-4077-abd3-d2e1558b6ea2\", \"966707d0-3269-4727-9be2-8c3a10f19b9d\", \"af78dc32-cf4d-46f9-ba4e-4428526346b5\", \"a9ea8996-122f-4c74-9520-8edcd192826c\", \"11648597-926c-4cf3-9c36-bcebb0ba8dcc\", \"644ef478-e28f-4e28-b9dc-3fdde9aa0b1f\", \"e8cef6f1-e4bd-4ea8-bc07-4b8d950f4477\", \"7be44c8a-adaf-4e2a-84d6-ab2649e08a13\", \"e8611ab8-c189-46e8-94e1-60213ab1f814\", \"4a5d8f65-41da-4de4-8968-e035b65339cf\", \"0964bb5e-9bdb-4d7b-ac29-58e794862a40\", \"8835291a-918c-4fd7-a9ce-faa49f0cf7d9\", \"194ae4cb-b126-40b2-bd5b-6091b380977d\", \"5f2222b1-57c3-48ba-8ad5-d4759f1fde6f\", \"f023fd81-a637-4b56-95fd-791ac0226033\", \"f28a1f50-f6e7-4571-818b-6a12f2af6b6c\", \"75941009-915a-4869-abe7-691bff18279e\", \"69091246-20e8-4a56-aa4d-066075b2a7a8\", \"baf37b3a-610e-45da-9e62-d9d1e5e8914b\", \"f70938a0-fc10-4177-9e90-2178f8765737\", \"fcf91098-03e3-41a9-b5ba-6f0ec8188a12\", \"3d762c5a-1b6c-493f-843e-55a3b42923d4\", \"112ca1a2-15ad-4102-995e-45b0bc479a6a\", \"75934031-6c7e-415a-99d7-48dbd49e875e\", \"fe930be7-5e62-47db-91af-98c3a49a38b1\", \"27460883-1df1-4691-b032-3b79643e5e63\", \"e300d9e7-4a2b-4295-9eff-f1c78b36cc98\", \"92b086b3-e367-4ef2-b869-1de128fb986e\", \"11451d60-acb2-45eb-a7d6-43d0f0125c13\", \"32696413-001a-46ae-978c-ce0f6b3620d2\", \"810a2642-a034-447f-a5e8-41beaa378541\", \"ac434307-12b9-4fa1-a708-88bf58caabc1\", \"10dae51f-b6af-4016-8d66-8c2a99b929b3\", \"9c094953-4995-41c8-84c8-3ebb9b32c93f\", \"2b499bcd-da44-4968-8aec-78e1674fa64d\", \"d405c6df-0af8-4e3b-95e4-4d06e542189e\", \"dd13091a-6207-4fc0-82ba-3641e056ab95\", \"963797fb-eb3b-4cde-8ce3-5878b3f32a3f\"], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"devices\": {\"deviceFilter\": {\"mode\": \"exclude\", \"rule\": \"device.isCompliant -eq True\"}}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('46563dd0-5608-4618-8f74-bbfd475faaf2')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"b40e2f53-0dfd-4519-8b80-7ba937ccd6cd",
    "policyName":"phishing-resistant MFA CA policy for users in administrative roles:",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"9b0b32a4-d4b3-40e0-b421-92a116ccd016\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('b40e2f53-0dfd-4519-8b80-7ba937ccd6cd')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": {\"id\": \"00000000-0000-0000-0000-000000000003\", \"createdDateTime\": \"2021-12-01T08:00:00Z\", \"modifiedDateTime\": \"2021-12-01T08:00:00Z\", \"displayName\": \"Passwordless MFA\", \"description\": \"Passwordless methods that satisfy strong authentication, such as Passwordless sign-in with the Microsoft Authenticator\", \"policyType\": \"builtIn\", \"requirementsSatisfied\": \"mfa\", \"allowedCombinations\": [\"windowsHelloForBusiness\", \"fido2\", \"x509CertificateMultiFactor\", \"deviceBasedPush\"], \"combinationConfigurations@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('b40e2f53-0dfd-4519-8b80-7ba937ccd6cd')\/grantControls\/authenticationStrength\/combinationConfigurations\", \"combinationConfigurations\": []}}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"12c94117-77f4-435c-adc0-10d33e4e9053",
    "policyName":"KK SIR - Location Based access",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"57c3fb5c-b597-44f9-8aff-fa903bd8edd4\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": [\"1ee66974-563a-48a3-ba96-9a0e57ed5653\", \"1ebb467e-53cf-445d-b5ba-aa901e967dcc\"]}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('12c94117-77f4-435c-adc0-10d33e4e9053')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"3bb468e4-59ba-4dbf-8fce-04116ecac46c",
    "policyName":"Intune MAM",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"9b0b32a4-d4b3-40e0-b421-92a116ccd016\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"android\", \"iOS\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"AND\", \"builtInControls\": [\"approvedApplication\", \"compliantApplication\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('3bb468e4-59ba-4dbf-8fce-04116ecac46c')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"a5a96565-f40a-413b-9d80-c92b669d96d4",
    "policyName":"CA003 - Require MFA & Complaint for Admin portal",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"MicrosoftAdminPortals\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [\"36860932-dfe6-4bef-ad58-3b2e3a146329\", \"9b0b32a4-d4b3-40e0-b421-92a116ccd016\", \"873eb7f1-486f-423f-82ff-433111a53924\", \"23d9748c-9b54-4772-988c-56d07fd3a97e\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [\"9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3\", \"cf1c38e5-3621-4004-a7cb-879624dced7c\", \"9c6df0f2-1e7c-4dc3-b195-66dfbd24aa8f\", \"c430b396-e693-46cc-96f3-db01bf8bb62a\", \"58a13ea3-c632-46ae-9ee0-9c0d43cd7f3d\", \"ffd52fa5-98dc-465c-991d-fc073eb59f8f\", \"8424c6f0-a189-499e-bbd0-26c1753c96d4\", \"1d336d2c-4ae8-42ef-9711-b3604ce3fc2c\", \"5b784334-f94b-471a-a387-e7219fc49ca2\", \"9c99539d-8186-4804-835f-fd51ef9e2dcd\", \"c4e39bd9-1100-46d3-8c65-fb160da0071f\", \"25a516ed-2fa0-40ea-a2d0-12923a21473a\", \"0526716b-113d-4c15-b2c8-68e3c22b9f80\", \"e3973bdf-4987-49ae-837a-ba8e231c7286\", \"7495fdc4-34c4-4d15-a289-98788ce399fd\", \"aaf43236-0c0d-4d5f-883a-6955382ac081\", \"3edaf663-341e-4475-9f94-5c398ef6c070\", \"b0f54661-2d74-4c50-afa3-1ec803f12efe\", \"892c5842-a9a6-463a-8041-72aa08ca3cf6\", \"158c047a-c907-4556-b7ef-446551a6b5f7\", \"7698a772-787b-4ac8-901f-60d6b08affd2\", \"17315797-102d-40b4-93e0-432062caca18\", \"e6d1a23a-da11-4be4-9570-befc86d067a7\", \"b1be1c3e-b65d-4f19-8427-f6fa0d97feb9\", \"5c4f9dcd-47dc-4cf7-8c9a-9e4207cbfc91\", \"38a96431-2bdf-4b4c-8b6e-5d3d8abac1a4\", \"9c094953-4995-41c8-84c8-3ebb9b32c93f\", \"2b499bcd-da44-4968-8aec-78e1674fa64d\", \"d405c6df-0af8-4e3b-95e4-4d06e542189e\", \"88d8e3e3-8f55-4a1e-953a-9b9898b8876b\", \"d29b2b05-8046-44ba-8758-1e26182fcf32\", \"9360feb5-f418-4baa-8175-e2a00bac4301\", \"8329153b-31d0-4727-b945-745eb3bc5f31\", \"44367163-eba1-44c3-98af-f5787879f96a\", \"963797fb-eb3b-4cde-8ce3-5878b3f32a3f\", \"3f1acade-1e04-4fbc-9b69-f0302cd84aef\", \"29232cdf-9323-42fd-ade2-1d097af3e4de\", \"31392ffb-586c-42d1-9346-e59415a2cc4e\", \"dd13091a-6207-4fc0-82ba-3641e056ab95\", \"6e591065-9bad-43ed-90f3-e9424366d2f0\", \"0f971eea-41eb-4569-a71e-57bb8a3eff1e\", \"be2f45a1-457d-42af-a067-6ec1fa63bc45\", \"a9ea8996-122f-4c74-9520-8edcd192826c\", \"62e90394-69f5-4237-9190-012177145e10\", \"ac434307-12b9-4fa1-a708-88bf58caabc1\", \"fdd7a751-b60b-444a-984c-02652fe8fa1c\", \"95e79109-95c0-4d8e-aee3-d01accf2d47b\", \"10dae51f-b6af-4016-8d66-8c2a99b929b3\", \"729827e3-9c14-49f7-bb1b-9608f156bbb8\", \"8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2\", \"45d8d3c5-c802-45c6-b32a-1d70b5e1e86e\", \"eb1f4a8d-243a-41f0-9fbd-c7cdf6c5ef7c\", \"25df335f-86eb-4119-b717-0ff02de207e9\", \"31e939ad-9672-4796-9c2e-873181342d2d\", \"3a2c62db-5318-420d-8d74-23affee5d9d5\", \"74ef975b-6605-40af-a5d2-b9539d836353\", \"b5a8dcf3-09d5-43a9-a639-8e29ef291470\", \"744ec460-397e-42ad-a462-8b3f9747a02c\", \"4d6ac14f-3453-41d0-bef9-a3e0c569773a\", \"59d46f88-662b-457b-bceb-5c3809e5908f\", \"ac16e43d-7b2d-40e0-ac05-243ff356ab5b\", \"790c1fb9-7f7d-4f88-86a1-ef1f95c05c1b\", \"8c8b803f-96e1-4129-9349-20738d9f9652\", \"9f06204d-73c1-4d4c-880a-6edb90606fd8\", \"1501b917-7653-4ff9-a4b5-203eaf33784f\", \"281fe777-fb20-4fbb-b7a3-ccebce5b0d96\", \"d37c8bed-0711-4417-ba38-b4abe66ce4c2\", \"2b745bdf-0803-4d80-aa65-822c4493daac\", \"a92aed5d-d78a-4d16-b381-09adb37eb3b0\", \"92ed04bf-c94a-4b82-9729-b799a7a4c178\", \"e48398e2-f4bb-4074-8f31-4586725e205b\", \"507f53e4-4e52-4077-abd3-d2e1558b6ea2\", \"4ba39ca4-527c-499a-b93d-d9b492c50246\", \"e00e864a-17c5-4a4b-9c06-f5b95a8d5bd8\", \"966707d0-3269-4727-9be2-8c3a10f19b9d\", \"af78dc32-cf4d-46f9-ba4e-4428526346b5\", \"11648597-926c-4cf3-9c36-bcebb0ba8dcc\", \"644ef478-e28f-4e28-b9dc-3fdde9aa0b1f\", \"e8cef6f1-e4bd-4ea8-bc07-4b8d950f4477\", \"7be44c8a-adaf-4e2a-84d6-ab2649e08a13\", \"e8611ab8-c189-46e8-94e1-60213ab1f814\", \"4a5d8f65-41da-4de4-8968-e035b65339cf\", \"2af84b1e-32c8-42b7-82bc-daa82404023b\", \"0964bb5e-9bdb-4d7b-ac29-58e794862a40\", \"8835291a-918c-4fd7-a9ce-faa49f0cf7d9\", \"194ae4cb-b126-40b2-bd5b-6091b380977d\", \"5f2222b1-57c3-48ba-8ad5-d4759f1fde6f\", \"f023fd81-a637-4b56-95fd-791ac0226033\", \"f28a1f50-f6e7-4571-818b-6a12f2af6b6c\", \"1a7d78b6-429f-476b-b8eb-35fb715fffd4\", \"75941009-915a-4869-abe7-691bff18279e\", \"69091246-20e8-4a56-aa4d-066075b2a7a8\", \"baf37b3a-610e-45da-9e62-d9d1e5e8914b\", \"f70938a0-fc10-4177-9e90-2178f8765737\", \"fcf91098-03e3-41a9-b5ba-6f0ec8188a12\", \"3d762c5a-1b6c-493f-843e-55a3b42923d4\", \"aa38014f-0993-46e9-9b45-30501a20909d\", \"112ca1a2-15ad-4102-995e-45b0bc479a6a\", \"75934031-6c7e-415a-99d7-48dbd49e875e\", \"a0b1b346-4d3e-4e8b-98f8-753987be4970\", \"fe930be7-5e62-47db-91af-98c3a49a38b1\", \"27460883-1df1-4691-b032-3b79643e5e63\", \"e300d9e7-4a2b-4295-9eff-f1c78b36cc98\", \"92b086b3-e367-4ef2-b869-1de128fb986e\", \"87761b17-1ed2-4af3-9acd-92a150038160\", \"11451d60-acb2-45eb-a7d6-43d0f0125c13\", \"32696413-001a-46ae-978c-ce0f6b3620d2\", \"c34f683f-4d5a-4403-affd-6615e00e3a7f\", \"810a2642-a034-447f-a5e8-41beaa378541\"], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"all\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"AND\", \"builtInControls\": [\"mfa\", \"compliantDevice\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('a5a96565-f40a-413b-9d80-c92b669d96d4')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"MicrosoftAdminPortals\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"218c10b1-6d3c-4e6e-b2a0-48525c95f997",
    "policyName":"Ahlan Cyber - Delphi Team",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"exchangeActiveSync\", \"mobileAppsAndDesktopClients\", \"other\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"f980f798-b403-4795-b0d8-6b9884be7ccb\", \"076f450d-f61e-4a4e-86cb-23cf0abe16ec\", \"50ef10d2-152f-432e-b2e4-4eb9d4b98c3e\", \"2abe7aea-038c-4ff9-9278-df212b29b177\", \"dbddeb22-a16a-480f-8ed4-d03ad30b40a7\", \"255d6e36-b327-4a40-82cd-875140f85aaa\", \"1487ce55-7e7a-477e-b759-00253caa7f45\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"windows\", \"macOS\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('218c10b1-6d3c-4e6e-b2a0-48525c95f997')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"da7b668d-ca87-479b-8e40-f116284421a7",
    "policyName":"MSO Support - Amit",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"63c81bce-6d95-449f-b366-f4c36cba8712\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": [\"1ebb467e-53cf-445d-b5ba-aa901e967dcc\"]}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('da7b668d-ca87-479b-8e40-f116284421a7')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"4a287724-dbf2-44d2-a273-7666d533c72b",
    "policyName":"Microsoft-managed: Multifactor authentication and reauthentication for risky sign-ins",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [\"high\"], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [], \"includeGroups\": [\"71af2ff2-e128-4e74-8118-410288004f46\"], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('4a287724-dbf2-44d2-a273-7666d533c72b')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"b7532997-3f96-4b56-9d2d-0a93f63ddd73",
    "policyName":"CA001 - GA roles access restriction",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"MicrosoftAdminPortals\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [\"9b0b32a4-d4b3-40e0-b421-92a116ccd016\", \"36860932-dfe6-4bef-ad58-3b2e3a146329\", \"23d9748c-9b54-4772-988c-56d07fd3a97e\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [\"62e90394-69f5-4237-9190-012177145e10\"], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"locations\": {\"includeLocations\": [\"All\"], \"excludeLocations\": [\"13188400-42db-4d25-a185-4dd5cb1d8906\"]}, \"devices\": {\"deviceFilter\": {\"mode\": \"exclude\", \"rule\": \"device.isCompliant -eq True\"}}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('b7532997-3f96-4b56-9d2d-0a93f63ddd73')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"MicrosoftAdminPortals\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"dc24f9cc-30fd-4dbd-9d8a-5dcab85f7817",
    "policyName":"Non Admin user restriction to Admin portals",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"MicrosoftAdminPortals\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [], \"includeGroups\": [], \"excludeGroups\": [\"c6ae8de0-52ae-4948-a3db-6841493b70c7\"], \"includeRoles\": [], \"excludeRoles\": [\"d2562ede-74db-457e-a7b6-544e236ebb61\", \"9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3\", \"cf1c38e5-3621-4004-a7cb-879624dced7c\", \"9c6df0f2-1e7c-4dc3-b195-66dfbd24aa8f\", \"c430b396-e693-46cc-96f3-db01bf8bb62a\", \"58a13ea3-c632-46ae-9ee0-9c0d43cd7f3d\", \"ffd52fa5-98dc-465c-991d-fc073eb59f8f\", \"8424c6f0-a189-499e-bbd0-26c1753c96d4\", \"1d336d2c-4ae8-42ef-9711-b3604ce3fc2c\", \"5b784334-f94b-471a-a387-e7219fc49ca2\", \"9c99539d-8186-4804-835f-fd51ef9e2dcd\", \"ecb2c6bf-0ab6-418e-bd87-7986f8d63bbe\", \"422218e4-db15-4ef9-bbe0-8afb41546d79\", \"c4e39bd9-1100-46d3-8c65-fb160da0071f\", \"25a516ed-2fa0-40ea-a2d0-12923a21473a\", \"0526716b-113d-4c15-b2c8-68e3c22b9f80\", \"e3973bdf-4987-49ae-837a-ba8e231c7286\", \"aaf43236-0c0d-4d5f-883a-6955382ac081\", \"3edaf663-341e-4475-9f94-5c398ef6c070\", \"7495fdc4-34c4-4d15-a289-98788ce399fd\", \"b0f54661-2d74-4c50-afa3-1ec803f12efe\", \"892c5842-a9a6-463a-8041-72aa08ca3cf6\", \"158c047a-c907-4556-b7ef-446551a6b5f7\", \"17315797-102d-40b4-93e0-432062caca18\", \"7698a772-787b-4ac8-901f-60d6b08affd2\", \"e6d1a23a-da11-4be4-9570-befc86d067a7\", \"b1be1c3e-b65d-4f19-8427-f6fa0d97feb9\", \"5c4f9dcd-47dc-4cf7-8c9a-9e4207cbfc91\", \"38a96431-2bdf-4b4c-8b6e-5d3d8abac1a4\", \"9c094953-4995-41c8-84c8-3ebb9b32c93f\", \"2b499bcd-da44-4968-8aec-78e1674fa64d\", \"d405c6df-0af8-4e3b-95e4-4d06e542189e\", \"88d8e3e3-8f55-4a1e-953a-9b9898b8876b\", \"d29b2b05-8046-44ba-8758-1e26182fcf32\", \"9360feb5-f418-4baa-8175-e2a00bac4301\", \"8329153b-31d0-4727-b945-745eb3bc5f31\", \"44367163-eba1-44c3-98af-f5787879f96a\", \"963797fb-eb3b-4cde-8ce3-5878b3f32a3f\", \"3f1acade-1e04-4fbc-9b69-f0302cd84aef\", \"29232cdf-9323-42fd-ade2-1d097af3e4de\", \"31392ffb-586c-42d1-9346-e59415a2cc4e\", \"dd13091a-6207-4fc0-82ba-3641e056ab95\", \"6e591065-9bad-43ed-90f3-e9424366d2f0\", \"0f971eea-41eb-4569-a71e-57bb8a3eff1e\", \"be2f45a1-457d-42af-a067-6ec1fa63bc45\", \"a9ea8996-122f-4c74-9520-8edcd192826c\", \"62e90394-69f5-4237-9190-012177145e10\", \"ac434307-12b9-4fa1-a708-88bf58caabc1\", \"843318fb-79a6-4168-9e6f-aa9a07481cc4\", \"f2ef992c-3afb-46b9-b7cf-a126ee74c451\", \"fdd7a751-b60b-444a-984c-02652fe8fa1c\", \"95e79109-95c0-4d8e-aee3-d01accf2d47b\", \"10dae51f-b6af-4016-8d66-8c2a99b929b3\", \"729827e3-9c14-49f7-bb1b-9608f156bbb8\", \"45d8d3c5-c802-45c6-b32a-1d70b5e1e86e\", \"8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2\", \"eb1f4a8d-243a-41f0-9fbd-c7cdf6c5ef7c\", \"25df335f-86eb-4119-b717-0ff02de207e9\", \"31e939ad-9672-4796-9c2e-873181342d2d\", \"3a2c62db-5318-420d-8d74-23affee5d9d5\", \"2ea5ce4c-b2d8-4668-bd81-3680bd2d227a\", \"74ef975b-6605-40af-a5d2-b9539d836353\", \"b5a8dcf3-09d5-43a9-a639-8e29ef291470\", \"744ec460-397e-42ad-a462-8b3f9747a02c\", \"4d6ac14f-3453-41d0-bef9-a3e0c569773a\", \"59d46f88-662b-457b-bceb-5c3809e5908f\", \"ac16e43d-7b2d-40e0-ac05-243ff356ab5b\", \"790c1fb9-7f7d-4f88-86a1-ef1f95c05c1b\", \"1707125e-0aa2-4d4d-8655-a7c786c76a25\", \"8c8b803f-96e1-4129-9349-20738d9f9652\", \"9f06204d-73c1-4d4c-880a-6edb90606fd8\", \"1501b917-7653-4ff9-a4b5-203eaf33784f\", \"281fe777-fb20-4fbb-b7a3-ccebce5b0d96\", \"2b745bdf-0803-4d80-aa65-822c4493daac\", \"d37c8bed-0711-4417-ba38-b4abe66ce4c2\", \"a92aed5d-d78a-4d16-b381-09adb37eb3b0\", \"92ed04bf-c94a-4b82-9729-b799a7a4c178\", \"e48398e2-f4bb-4074-8f31-4586725e205b\", \"507f53e4-4e52-4077-abd3-d2e1558b6ea2\", \"4ba39ca4-527c-499a-b93d-d9b492c50246\", \"e00e864a-17c5-4a4b-9c06-f5b95a8d5bd8\", \"966707d0-3269-4727-9be2-8c3a10f19b9d\", \"024906de-61e5-49c8-8572-40335f1e0e10\", \"11648597-926c-4cf3-9c36-bcebb0ba8dcc\", \"644ef478-e28f-4e28-b9dc-3fdde9aa0b1f\", \"af78dc32-cf4d-46f9-ba4e-4428526346b5\", \"e8cef6f1-e4bd-4ea8-bc07-4b8d950f4477\", \"7be44c8a-adaf-4e2a-84d6-ab2649e08a13\", \"e8611ab8-c189-46e8-94e1-60213ab1f814\", \"4a5d8f65-41da-4de4-8968-e035b65339cf\", \"2af84b1e-32c8-42b7-82bc-daa82404023b\", \"0964bb5e-9bdb-4d7b-ac29-58e794862a40\", \"8835291a-918c-4fd7-a9ce-faa49f0cf7d9\", \"194ae4cb-b126-40b2-bd5b-6091b380977d\", \"5f2222b1-57c3-48ba-8ad5-d4759f1fde6f\", \"5d6b6bb7-de71-4623-b4af-96380a352509\", \"f023fd81-a637-4b56-95fd-791ac0226033\", \"f28a1f50-f6e7-4571-818b-6a12f2af6b6c\", \"1a7d78b6-429f-476b-b8eb-35fb715fffd4\", \"75941009-915a-4869-abe7-691bff18279e\", \"69091246-20e8-4a56-aa4d-066075b2a7a8\", \"baf37b3a-610e-45da-9e62-d9d1e5e8914b\", \"f70938a0-fc10-4177-9e90-2178f8765737\", \"fcf91098-03e3-41a9-b5ba-6f0ec8188a12\", \"3d762c5a-1b6c-493f-843e-55a3b42923d4\", \"aa38014f-0993-46e9-9b45-30501a20909d\", \"112ca1a2-15ad-4102-995e-45b0bc479a6a\", \"75934031-6c7e-415a-99d7-48dbd49e875e\", \"a0b1b346-4d3e-4e8b-98f8-753987be4970\", \"fe930be7-5e62-47db-91af-98c3a49a38b1\", \"27460883-1df1-4691-b032-3b79643e5e63\", \"e300d9e7-4a2b-4295-9eff-f1c78b36cc98\", \"92b086b3-e367-4ef2-b869-1de128fb986e\", \"87761b17-1ed2-4af3-9acd-92a150038160\", \"11451d60-acb2-45eb-a7d6-43d0f0125c13\", \"32696413-001a-46ae-978c-ce0f6b3620d2\", \"c34f683f-4d5a-4403-affd-6615e00e3a7f\", \"810a2642-a034-447f-a5e8-41beaa378541\"], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"block\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('dc24f9cc-30fd-4dbd-9d8a-5dcab85f7817')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"MicrosoftAdminPortals\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"3ab1c6da-439d-45cd-a02a-ea4a33585f51",
    "policyName":"Duplicate - Microsoft-managed: Multifactor authentication and reauthentication for risky sign-ins COPY",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [\"high\"], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [], \"includeGroups\": [\"71af2ff2-e128-4e74-8118-410288004f46\"], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('3ab1c6da-439d-45cd-a02a-ea4a33585f51')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"066f68d1-506b-44ea-8dec-266c97f22e58",
    "policyName":"CA005 - Require MFA for risky sign-ins (High & Medium))",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [\"high\", \"medium\"], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\", \"9b0b32a4-d4b3-40e0-b421-92a116ccd016\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('066f68d1-506b-44ea-8dec-266c97f22e58')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"00e6c2e0-94c3-4e5d-955a-dd73fe67e2d3",
    "policyName":"CA007 - Require password change for high-risk users",
    "conditions":"{\"userRiskLevels\": [\"high\"], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\", \"9b0b32a4-d4b3-40e0-b421-92a116ccd016\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"AND\", \"builtInControls\": [\"mfa\", \"passwordChange\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('00e6c2e0-94c3-4e5d-955a-dd73fe67e2d3')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"64cfe71e-c450-4feb-bb03-2a93c921c3fc",
    "policyName":"CA006 - Require MFA for Medium-risk users",
    "conditions":"{\"userRiskLevels\": [\"medium\"], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\", \"9b0b32a4-d4b3-40e0-b421-92a116ccd016\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('64cfe71e-c450-4feb-bb03-2a93c921c3fc')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"b21575a8-9523-481d-96a3-aa7dabedb74a",
    "policyName":"Require multifactor authentication for admins",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [\"62e90394-69f5-4237-9190-012177145e10\", \"194ae4cb-b126-40b2-bd5b-6091b380977d\", \"f28a1f50-f6e7-4571-818b-6a12f2af6b6c\", \"29232cdf-9323-42fd-ade2-1d097af3e4de\", \"b1be1c3e-b65d-4f19-8427-f6fa0d97feb9\", \"729827e3-9c14-49f7-bb1b-9608f156bbb8\", \"b0f54661-2d74-4c50-afa3-1ec803f12efe\", \"fe930be7-5e62-47db-91af-98c3a49a38b1\", \"c4e39bd9-1100-46d3-8c65-fb160da0071f\", \"9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3\", \"158c047a-c907-4556-b7ef-446551a6b5f7\", \"966707d0-3269-4727-9be2-8c3a10f19b9d\", \"7be44c8a-adaf-4e2a-84d6-ab2649e08a13\", \"e8611ab8-c189-46e8-94e1-60213ab1f814\"], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('b21575a8-9523-481d-96a3-aa7dabedb74a')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"f94ef4c3-0966-4e8b-9b59-864bbcd57152",
    "policyName":"CA010 - Require MAM for Android & IOS",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [], \"includeGroups\": [\"7ac6c028-814c-45af-b3ea-4031ea592ed8\"], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"platforms\": {\"includePlatforms\": [\"android\", \"iOS\"], \"excludePlatforms\": []}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"compliantApplication\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('f94ef4c3-0966-4e8b-9b59-864bbcd57152')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"2f07bcb5-b4aa-4e61-a569-8a4d282e7bf4",
    "policyName":"CA009 - Require multifactor authentication for guest access",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"excludeGuestsOrExternalUsers\": null, \"includeGuestsOrExternalUsers\": {\"guestOrExternalUserTypes\": \"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider\", \"externalTenants\": {\"@odata.type\": \"#microsoft.graph.conditionalAccessAllExternalTenants\", \"membershipKind\": \"all\"}}}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('2f07bcb5-b4aa-4e61-a569-8a4d282e7bf4')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"409cfebc-c7e5-4c27-83eb-76bf8b2c6600",
    "policyName":"CA008 - Require multifactor authentication for Azure management",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"devices\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"797f4846-ba00-4fd7-ba43-dac1f8f63013\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}}",
    "grantControls":"{\"operator\": \"OR\", \"builtInControls\": [\"mfa\"], \"customAuthenticationFactors\": [], \"termsOfUse\": [], \"authenticationStrength@odata.context\": \"https:\/\/graph.microsoft.com\/v1.0\/$metadata#identity\/conditionalAccess\/policies('409cfebc-c7e5-4c27-83eb-76bf8b2c6600')\/grantControls\/authenticationStrength\/$entity\", \"authenticationStrength\": null}",
    "includedApplications":"[\"797f4846-ba00-4fd7-ba43-dac1f8f63013\"]",
    "excludedApplications":"[]"
  },
  {
    "policyId":"be7b2d37-6dd5-4943-843a-0839ad3ebe2c",
    "policyName":"No persistent browser session",
    "conditions":"{\"userRiskLevels\": [], \"signInRiskLevels\": [], \"clientAppTypes\": [\"all\"], \"servicePrincipalRiskLevels\": [], \"insiderRiskLevels\": null, \"platforms\": null, \"locations\": null, \"clientApplications\": null, \"authenticationFlows\": null, \"applications\": {\"includeApplications\": [\"All\"], \"excludeApplications\": [], \"includeUserActions\": [], \"includeAuthenticationContextClassReferences\": [], \"applicationFilter\": null}, \"users\": {\"includeUsers\": [\"All\"], \"excludeUsers\": [\"a7387f54-4dc8-416f-b2be-6cb77c249931\"], \"includeGroups\": [], \"excludeGroups\": [], \"includeRoles\": [], \"excludeRoles\": [], \"includeGuestsOrExternalUsers\": null, \"excludeGuestsOrExternalUsers\": null}, \"devices\": {\"deviceFilter\": {\"mode\": \"include\", \"rule\": \"device.trustType -ne \\\"ServerAD\\\" -or device.isCompliant -ne True\"}}}",
    "grantControls":null,
    "includedApplications":"[\"All\"]",
    "excludedApplications":"[]"
  }
]